---
kind: method
id: M:Autodesk.Revit.DB.FilteredElementIdIterator.Dispose
source: html/3b640fff-8676-9a8e-d541-083e5b0ddd31.htm
---
# Autodesk.Revit.DB.FilteredElementIdIterator.Dispose Method

Releases all resources used by the FilteredElementIdIterator

## Syntax (C#)
```csharp
public void Dispose()
```